content/1-Cryptography/materials/zk-factorization-example/gate-constrains.org
#+OPTIONS: toc:nil

* Gate constrains:

** Multiplication constrain:

  - $r * s = n$

** constraining $r \neq 1$
  - Making sure that the prover doesn't fool the verifier by using 1 as a factor.
  - We force them to use r-1's inverse. 
  - $(r-1)(r-1)^{-1} = 1 \Rightarrow  r * (r-1)^{-1} - (r-1)^{-1} = 1$

** constraining $0< r < 8$:
 We need to make sure r % p = r
 otherwise prover can cheat because everything has an inverse in $FF_p$
 We use Binary decomposition:
  - $r0 + 2 * r1 = r01$
  - $r01 + 4 * r2 = r$ 
  - $r0 * r0 - r0 = 0$
  - $r1 * r1 - r1 = 0$
  - $r2 * r2 - r2 = 0$

** similarly constraining $b$:

  - $s0 + 2 * s1 = s01$
  - $s01 + 4 * s2 = s$ 
  - $s0 * s0 - s0 = 0$
  - $s1 * s1 - s1 = 0$
  - $s2 * s2 - s2 = 0$
  - $s * (s-1)^{-1} - (s-1)^{-1} = 1$

* Universal way of summerizing constrains:
 $Q_l*a + Q_r*b + Q_o*c + Q_m*a*b + Q_c = 0$

* Constrain for factorization:
 $Q_l*a + Q_r*b + Q_o*c + Q_m*a*b + Q_c = 0$
 
 | Gate No | Q_l | Q_r | Q_o | Q_m | Q_c | a | b | c |
 |---------+-----+-----+-----+-----+-----+---+---+---|
 |       1 |   0 |   0 |   0 |   1 | -n  | r | s | 0 |

* Constrain table $a$
 $Q_l*a + Q_r*b + Q_o*c + Q_m*a*b + Q_c = 0$

 | Gate No | Q_l | Q_r | Q_o | Q_m | Q_c | a   | b        |   c |
 |---------+-----+-----+-----+-----+-----+-----+----------+-----|
 |       2 |   1 |   2 |  -1 |   0 |   0 | r0  | r1       | r01 |
 |       3 |   1 |   4 |  -1 |   0 |   0 | r01 | r2       |   r |
 |       4 |  -1 |   0 |   0 |   1 |   0 | r0  | r0       |   0 |
 |       5 |  -1 |   0 |   0 |   1 |   0 | r1  | r1       |   0 |
 |       6 |  -1 |   0 |   0 |   1 |   0 | r2  | r2       |   0 |
 |       7 |   0 |  -1 |   0 |   1 |  -1 | r   | (r-1)^-1 |   0 |
 |---------+-----+-----+-----+-----+-----+-----+----------+-----|

* Constrain table  $b$
 $Q_l*a + Q_r*b + Q_o*c + Q_m*a*b + Q_c = 0$

 | Gate No | Q_l | Q_r | Q_o | Q_m | Q_c | a   | b        |   c |
 |---------+-----+-----+-----+-----+-----+-----+----------+-----|
 |       8 |   1 |   2 |  -1 |   0 |   0 | s0  | s1       | s01 |
 |       9 |   1 |   4 |  -1 |   0 |   0 | s01 | s2       |   s |
 |      10 |  -1 |   0 |   0 |   1 |   0 | s0  | s0       |   0 |
 |      11 |  -1 |   0 |   0 |   1 |   0 | s1  | s1       |   0 |
 |      12 |  -1 |   0 |   0 |   1 |   0 | s2  | s2       |   0 |
 |      13 |   0 |  -1 |   0 |   1 |  -1 | s   | (s-1)^-1 |   0 |
 |---------+-----+-----+-----+-----+-----+-----+----------+-----|

* all constraints for wiring
 | Gate No | Q_l | Q_r | Q_o | Q_m | Q_c | a   | b        |   c |
 |---------+-----+-----+-----+-----+-----+-----+----------+-----|
 |       1 |   0 |   0 |   0 |   1 |  -n | r   | s        |   0 |
 |       2 |   1 |   2 |  -1 |   0 |   0 | r0  | r1       | r01 |
 |       3 |   1 |   4 |  -1 |   0 |   0 | r01 | r2       |   r |
 |       4 |  -1 |   0 |   0 |   1 |   0 | r0  | r0       |   0 |
 |       5 |  -1 |   0 |   0 |   1 |   0 | r1  | r1       |   0 |
 |       6 |  -1 |   0 |   0 |   1 |   0 | r2  | r2       |   0 |
 |       7 |   0 |  -1 |   0 |   1 |  -1 | r   | (r-1)^-1 |   0 |
 |       8 |   1 |   2 |  -1 |   0 |   0 | s0  | s1       | s01 |
 |       9 |   1 |   4 |  -1 |   0 |   0 | s01 | s2       |   s |
 |      10 |  -1 |   0 |   0 |   1 |   0 | s0  | s0       |   0 |
 |      11 |  -1 |   0 |   0 |   1 |   0 | s1  | s1       |   0 |
 |      12 |  -1 |   0 |   0 |   1 |   0 | s2  | s2       |   0 |
 |      13 |   0 |  -1 |   0 |   1 |  -1 | s   | (s-1)^-1 |   0 |
 |---------+-----+-----+-----+-----+-----+-----+----------+-----|

* Trace polynomial for wiring with omega
 | Gate | a                       | b                            | c                       |
 |------+-------------------------+------------------------------+-------------------------|
 |    1 | $T(\omega^1) := r$      | $T(\omega^2):=s$             | $T(\omega^3) :=  0$     |
 |    2 | $T(\omega^4) := r0$     | $T(\omega^5):=r1$            | $T(\omega^6) := r01$    |
 |    3 | $T(\omega^7) := r01$    | $T(\omega^8) := r2$          | $T(\omega^9) := r$      |
 |    4 | $T(\omega^{10}) := r0$  | $T(\omega^{11}) := r0$       | $T(\omega^{12}) := 0$   |
 |    5 | $T(\omega^{13}) := r1$  | $T(\omega^{14}) := r1$       | $T(\omega^{15}) := 0$   |
 |    6 | $T(\omega^{16}) := r2$  | $T(\omega^{17}) := r2$       | $T(\omega^{18}) := 0$   |
 |    7 | $T(\omega^{19}) := r$   | $T(\omega^{20}) := (r-1)^-1$ | $T(\omega^{21}) := 0$   |
 |    8 | $T(\omega^{22}) := s0$  | $T(\omega^{23}) := s1$       | $T(\omega^{24}) := s01$ |
 |    9 | $T(\omega^{25}) := s01$ | $T(\omega^{26}) := s2$       | $T(\omega^{27}) := s$   |
 |   10 | $T(\omega^{28}) := s0$  | $T(\omega^{29}) := s0$       | $T(\omega^{30}) := 0$   |
 |   11 | $T(\omega^{31}) := s1$  | $T(\omega^{32}) := s1$       | $T(\omega^{33}) := 0$   |
 |   12 | $T(\omega^{34}) := s2$  | $T(\omega^{35}) := s2$       | $T(\omega^{36}) := 0$   |
 |   13 | $T(\omega^{37}) := s$   | $T(\omega^{38}) := (s-1)^-1$ | $T(\omega^{39}) := 0$   |
 |------+-------------------------+------------------------------+-------------------------|

 
* Permutation Psi with omega
  | Gate | a                                  | b                                  | c                                  |
  |------+------------------------------------+------------------------------------+------------------------------------|
  |    1 | $\Psi(\omega^1) := \omega^9$       | $\Psi(\omega^2):=\omega^{27}$      | $\Psi(\omega^3) := \omega^3$       |
  |    2 | $\Psi(\omega^4) := \omega^{10}$    | $\Psi(\omega^5):=\omega^{13}$      | $\Psi(\omega^6) := \omega^7$       |
  |    3 | $\Psi(\omega^7) := \omega^6$       | $\Psi(\omega^8) := \omega^{16}$    | $\Psi(\omega^9) := \omega^{19}$    |
  |    4 | $\Psi(\omega^{10}) := \omega^{11}$ | $\Psi(\omega^{11}) := \omega^4$    | $\Psi(\omega^{12}) := \omega^{12}$ |
  |    5 | $\Psi(\omega^{13}) := \omega^{14}$ | $\Psi(\omega^{14}) := \omega^{5}$  | $\Psi(\omega^{15}) := \omega^{15}$ |
  |    6 | $\Psi(\omega^{16}) := \omega^{17}$ | $\Psi(\omega^{17}) := \omega^{8}$  | $\Psi(\omega^{18}) := \omega^{18}$ |
  |    7 | $\Psi(\omega^{19}) := \omega^{1}$  | $\Psi(\omega^{20}) := \omega^{20}$ | $\Psi(\omega^{21}) := \omega^{21}$ |
  |    8 | $\Psi(\omega^{22}) := \omega^{28}$ | $\Psi(\omega^{23}) := \omega^{31}$ | $\Psi(\omega^{24}) := \omega^{25}$ |
  |    9 | $\Psi(\omega^{25}) := \omega^{24}$ | $\Psi(\omega^{26}) := \omega^{34}$ | $\Psi(\omega^{27}) := \omega^{37}$ |
  |   10 | $\Psi(\omega^{28}) := \omega^{29}$ | $\Psi(\omega^{29}) := \omega^{22}$ | $\Psi(\omega^{30}) := \omega^{30}$ |
  |   11 | $\Psi(\omega^{31}) := \omega^{31}$ | $\Psi(\omega^{32}) := \omega^{31}$ | $\Psi(\omega^{33}) := \omega^{33}$ |
  |   12 | $\Psi(\omega^{34}) := \omega^{35}$ | $\Psi(\omega^{35}) := \omega^{35}$ | $\Psi(\omega^{36}) := \omega^{36}$ |
  |   13 | $\Psi(\omega^{37}) := \omega^{2}$  | $\Psi(\omega^{38}) := \omega^{38}$ | $\Psi(\omega^{39}) := \omega^{39}$ |
  |------+------------------------------------+------------------------------------+------------------------------------|

* Trace polynomial for wiring
 | Gate | a                | b                     | c                |
 |------+------------------+-----------------------+------------------|
 |    1 | $T(1) := r$      | $T(2):=s$             | $T(3) :=  0$     |
 |    2 | $T(4) := r0$     | $T(5):=r1$            | $T(6) := r01$    |
 |    3 | $T(7) := r01$    | $T(8) := r2$          | $T(9) := r$      |
 |    4 | $T({10}) := r0$  | $T({11}) := r0$       | $T({12}) := 0$   |
 |    5 | $T({13}) := r1$  | $T({14}) := r1$       | $T({15}) := 0$   |
 |    6 | $T({16}) := r2$  | $T({17}) := r2$       | $T({18}) := 0$   |
 |    7 | $T({19}) := r$   | $T({20}) := (r-1)^-1$ | $T({21}) := 0$   |
 |    8 | $T({22}) := s0$  | $T({23}) := s1$       | $T({24}) := s01$ |
 |    9 | $T({25}) := s01$ | $T({26}) := s2$       | $T({27}) := s$   |
 |   10 | $T({28}) := s0$  | $T({29}) := s0$       | $T({30}) := 0$   |
 |   11 | $T({31}) := s1$  | $T({32}) := s1$       | $T({33}) := 0$   |
 |   12 | $T({34}) := s2$  | $T({35}) := s2$       | $T({36}) := 0$   |
 |   13 | $T({37}) := s$   | $T({38}) := (s-1)^-1$ | $T({39}) := 0$   |
 |------+------------------+-----------------------+------------------|
 
* Permutation Psi
  | Gate | a                    | b                    | c                    |
  |------+----------------------+----------------------+----------------------|
  |    1 | $\Psi(1) := 9$       | $\Psi(2):={27}$      | $\Psi(3) := 3$       |
  |    2 | $\Psi(4) := {10}$    | $\Psi(5):={13}$      | $\Psi(6) := 7$       |
  |    3 | $\Psi(7) := 6$       | $\Psi(8) := {16}$    | $\Psi(9) := {19}$    |
  |    4 | $\Psi({10}) := {11}$ | $\Psi({11}) := 4$    | $\Psi({12}) := {12}$ |
  |    5 | $\Psi({13}) := {14}$ | $\Psi({14}) := {5}$  | $\Psi({15}) := {15}$ |
  |    6 | $\Psi({16}) := {17}$ | $\Psi({17}) := {8}$  | $\Psi({18}) := {18}$ |
  |    7 | $\Psi({19}) := {1}$  | $\Psi({20}) := {20}$ | $\Psi({21}) := {21}$ |
  |    8 | $\Psi({22}) := {28}$ | $\Psi({23}) := {31}$ | $\Psi({24}) := {25}$ |
  |    9 | $\Psi({25}) := {24}$ | $\Psi({26}) := {34}$ | $\Psi({27}) := {37}$ |
  |   10 | $\Psi({28}) := {29}$ | $\Psi({29}) := {22}$ | $\Psi({30}) := {30}$ |
  |   11 | $\Psi({31}) := {31}$ | $\Psi({32}) := {31}$ | $\Psi({33}) := {33}$ |
  |   12 | $\Psi({34}) := {35}$ | $\Psi({35}) := {35}$ | $\Psi({36}) := {36}$ |
  |   13 | $\Psi({37}) := {2}$  | $\Psi({38}) := {38}$ | $\Psi({39}) := {39}$ |
  |------+----------------------+----------------------+----------------------|

* Gate Polynomial
Summerizing all of our constrains in one polynomial:

$Q_l(x)*a(x) + Q_r(x)*b(x) + Q_o(x)* c(x) + Q_m(x)*a(x)*b(x) + Q_c(x) = 0$

